MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK11DN512AVLK5/mcu.h
#define EEPROM data set size          0x2000000000000000000000000000000000000000000000000000000000000000      // EEPROM data set size
#define FlexNVM partition code        0x1000000000000000000000000000000000000000000000000000000000000000      // FlexNVM partition code


//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM Data Set Size register.
//
//*****************************************************************************

#define EEESPLIT                      0x00000180      // EEPROM Split Factor — Determines the relative sizes of the two EEPROM subsystems
#define EEESPLIT                      0x00000060      // EEPROM Split Factor — Determines the relative sizes of the two EEPROM subsystems
#define EEESIZE                       0x00000078      // EEPROM Size — Encoding of the total available FlexRAM for EEPROM use


//*****************************************************************************
//
// The following are defines for the bit fields in the FlexNVM Partition Code register.
//
//*****************************************************************************

#define DEPART                        0x00000780      // FlexNVM Partition Code — Encoding of the data flash / EEPROM backup split within the FlexNVM memory block
#define DEPART                        0x00000078      // FlexNVM Partition Code — Encoding of the data flash / EEPROM backup split within the FlexNVM memory block


//*****************************************************************************
//
// The following are defines for the bit fields in the Register Descriptions register.
//
//*****************************************************************************




//*****************************************************************************
//
// The following are defines for the bit fields in the FTFL_FSTAT register.
//
//*****************************************************************************

#define CCIF                          0x00000080      // Command Complete Interrupt Flag
#define RDCOLERR                      0x00000040      // Flash Read Collision Error Flag
#define ACCERR                        0x00000020      // Flash Access Error Flag
#define FPVIOL                        0x00000010      // Flash Protection Violation Flag
#define MGSTAT0                       0x00000001      // Memory Controller Command Completion Status Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the FTFL_FCNFG register.
//
//*****************************************************************************

#define CCIE                          0x00000080      // Command Complete Interrupt Enable
#define RDCOLLIE                      0x00000040      // Read Collision Error Interrupt Enable
#define ERSAREQ                       0x00000020      // Erase All Request
#define ERSSUSP                       0x00000010      // Erase Suspend
#define SWAP                          0x00000008      // Swap
#define PFLSH                         0x00000004      // Flash memory configuration
#define RAMRDY                        0x00000002      // RAM Ready
#define EEERDY                        0x00000001      // For devices with FlexNVM: This flag indicates if the EEPROM backup data has been copied to the FlexRAM and is therefore available for read access


//*****************************************************************************
//
// The following are defines for the bit fields in the FTFL_FSEC register.
//
//*****************************************************************************

#define KEYEN                         0x00000180      // Backdoor Key Security Enable
#define MEEN                          0x00000060      // Mass Erase Enable Bits
#define FSLACC                        0x00000018      // Freescale Failure Analysis Access Code
#define SEC                           0x00000006      // Flash Security


//*****************************************************************************
//
// The following are defines for the bit fields in the FTFL_FOPT register.
//
//*****************************************************************************

#define OPT                           0x00007F80      // Nonvolatile Option


//*****************************************************************************
//
// The following are defines for the bit fields in the FTFL_FCCOBn register.
//
//*****************************************************************************

#define CCOBn                         0x00007F80      // The FCCOB register provides a command code and relevant parameters to the memory controller


//*****************************************************************************
//
// The following are defines for the bit fields in the FTFL_FPROTn register.
//
//*****************************************************************************

#define PROT                          0x00007F80      // Program Flash Region Protect


//*****************************************************************************
//
// The following are defines for the bit fields in the FTFL_FEPROT register.
//
//*****************************************************************************

#define EPROT                         0x00007F80      // EEPROM Region Protect


//*****************************************************************************
//
// The following are defines for the bit fields in the FTFL_FDPROT register.
//
//*****************************************************************************

#define DPROT                         0x00007F80      // Data Flash Region Protect
#define DPROT                         0x00007F80      // Data Flash Region Protect


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_DATA register.
//
//*****************************************************************************

